* Emacs code-execution
*(Wanna see the source?  Click the martini glass.)*

Leisure can use orgmode's code execution features.

If you hit C-c C-c in a language that Leisure can't execute (e.g. sh),
Leisure will attempt to execute in Emacs.  You can try it here:

#+BEGIN_SRC sh :results output
ls /tmp
#+END_SRC

Webby code blocks execute in the browser directly.

Go to Leisure and hit C-C C-C in this block:

#+BEGIN_SRC coffee
alert 'hello'
#+END_SRC

This is a dynamic block.  Go to Emacs and alter the code in this block
and Leisure will update the results as you type.

#+BEGIN_SRC coffee :results dynamic
3 + 4
#+END_SRC
#+RESULTS:
: 7

Clicking an elisp link in Leisure will run it in Emacs.  Click this
and it will [[elisp:(message "Hello from Leisure!")][show a message]] in Emacs.
